Documents/ИнвентаризацияМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ИнвентаризацияМатериалов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПоУчету</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокФактический</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИнвентаризацияМатериалов/Ext/ObjectModule.bsl
// Процедура ПередЗаписью выполняется перед записью документа.
// В этом коде проверяется правильность заполнения инвентаризации:
// указан ли склад, заполнена ли табличная часть,
// нет ли отрицательных остатков, а также пересчитываются отклонения.
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// Проверяем, указан ли склад.
	// Без склада нельзя проводить инвентаризацию,
	// потому что остатки материалов ведутся в разрезе складов.
	Если Не ЗначениеЗаполнено(Склад) Тогда
		
		// Сообщаем пользователю об ошибке.
		Сообщить("Не указан склад.");
		
		// Отменяем запись документа.
		Отказ = Истина;
		
		// Завершаем выполнение процедуры.
		Возврат;
		
	КонецЕсли;

	// Проверяем, есть ли строки в табличной части "Материалы".
	// Если строк нет, инвентаризацию записывать нельзя.
	Если Материалы.Количество() = 0 Тогда
		
		// Выводим сообщение пользователю.
		Сообщить("Табличная часть материалов не заполнена.");
		
		// Отменяем запись документа.
		Отказ = Истина;
		
		// Завершаем выполнение процедуры.
		Возврат;
		
	КонецЕсли;

	// Переменная показывает, есть ли в документе хотя бы одна строка
	// с заполненным материалом.
	ЕстьСтроки = Ложь;

	// Перебираем все строки табличной части "Материалы".
	Для Каждого СтрМатериал Из Материалы Цикл

		// Если материал в строке не заполнен,
		// такую строку пропускаем.
		Если Не ЗначениеЗаполнено(СтрМатериал.Материал) Тогда
			Продолжить;
		КонецЕсли;

		// Если материал заполнен, значит в документе есть корректная строка.
		ЕстьСтроки = Истина;

		// Проверяем остаток по учету.
		// Учетный остаток не должен быть отрицательным.
		Если СтрМатериал.ОстатокПоУчету < 0 Тогда
			
			// Выводим сообщение с названием материала.
			Сообщить(СтрШаблон(
				"Остаток по учету по материалу ""%1"" не может быть отрицательным.",
				СтрМатериал.Материал));
				
			// Отменяем запись документа.
			Отказ = Истина;
			
			// Завершаем выполнение процедуры.
			Возврат;
			
		КонецЕсли;

		// Проверяем фактический остаток.
		// Фактический остаток также не должен быть отрицательным.
		Если СтрМатериал.ОстатокФактический < 0 Тогда
			
			// Выводим сообщение с названием материала.
			Сообщить(СтрШаблон(
				"Фактический остаток по материалу ""%1"" не может быть отрицательным.",
				СтрМатериал.Материал));
				
			// Отменяем запись документа.
			Отказ = Истина;
			
			// Завершаем выполнение процедуры.
			Возврат;
			
		КонецЕсли;

		// Если учетная цена не заполнена,
		// считаем ее равной нулю.
		Если Не ЗначениеЗаполнено(СтрМатериал.ЦенаУчета) Тогда
			СтрМатериал.ЦенаУчета = 0;
		КонецЕсли;

		// Рассчитываем отклонение по количеству.
		// Формула:
		// фактический остаток минус остаток по учету.
		//
		// Если отклонение меньше 0 — это недостача.
		// Если отклонение больше 0 — это излишек.
		// Если отклонение равно 0 — расхождений нет.
		СтрМатериал.Отклонение =
			СтрМатериал.ОстатокФактический - СтрМатериал.ОстатокПоУчету;

		// Рассчитываем сумму отклонения.
		// Формула:
		// отклонение * учетная цена.
		//
		// Окр(..., 2) округляет сумму до двух знаков после запятой.
		СтрМатериал.СуммаОтклонения =
			Окр(СтрМатериал.Отклонение * СтрМатериал.ЦенаУчета, 2);

	КонецЦикла;

	// После обхода всех строк проверяем,
	// была ли найдена хотя бы одна строка с материалом.
	Если Не ЕстьСтроки Тогда
		
		// Если все строки пустые или материалов нет,
		// документ записывать нельзя.
		Сообщить("В документе нет корректных строк материалов.");
		
		// Отменяем запись документа.
		Отказ = Истина;
		
		// Завершаем выполнение процедуры.
		Возврат;
		
	КонецЕсли;

КонецПроцедуры
